IdeaRS.Connections
PlateDataBase Properties
Compatible with IDEA StatiCa 0.0
The PlateDataBase type exposes the following members.
Properties
Name | Description
IsActive |  (Inherited from ConnectionCmdData.)
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
ShapeData
 Collection of plate editor data
Thickness
 Gets or sets the thickness of the plate
Top
See Also
Reference
PlateDataBase Class
IdeaRS.Connections.Data Namespace